ib2b-documentation/output/services/managespinventory/queryNetworkInventory/Normal - Get Network Inventory List For BEAM/00_getNetworkInventoryRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
	@operation queryNetworkInventory
	@action queryNetworkInventoryList
	@sender FLS
	@receiver EPS
	@scenario Query network inventory list
	@name Normal - Query Network Inventory List for BEAM
	@description This is a sample request message for the scenario: Query network inventory list for BEAM is successful
	@version V1.0
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:dns="http://www.nbnco.com.au/cim/manageSPInventory/v5"
	xmlns:mhe="http://www.nbnco.com.au/cim/common/messageHeader/v3">
	<soapenv:Header>
		<mhe:MessageHeader>
			<activityName>queryNetworkInventory</activityName>
			<msgName>ManageSPInventoryqueryNetworkInventoryRequest</msgName>
			<businessServiceName>ManageSPInventory</businessServiceName>
			<businessServiceVersion>V1.0</businessServiceVersion>
			<msgType>Request</msgType>
			<accessSeekerID>SDP000000000001</accessSeekerID>
			<correlationId>4eef4405-606e-46db-8c5c-af78e2874077</correlationId>
			<security>Placeholder Security</security>
			<priority>6</priority>
			<communicationPattern>RequestReply</communicationPattern>
			<timestamp>2014-08-18T12:00:01Z</timestamp>
			<businessChannel>Fulfilment</businessChannel>
			<HeaderCharacteristicValue>
				<value>FALSE</value>
				<Characteristic>
					<name>Mocked</name>
				</Characteristic>
			</HeaderCharacteristicValue>
		</mhe:MessageHeader>
	</soapenv:Header>
	<soapenv:Body>
		<dns:ManageSPInventoryRequest>
			<SPInventory>
				<interactionDate>2014-08-18T12:00:00.000Z</interactionDate>
				<SPInventoryComprisedOf>
					<!-- NSAS or NWAS -->
					<ItemInvolvesProduct>
						<type>NSAS</type>
					</ItemInvolvesProduct>
					<ReferencesSPInventoryItem>
						<ItemInvolvesResource>
							<type>BEAM</type>
						</ItemInvolvesResource>
					</ReferencesSPInventoryItem>
					<ReferencesSPInventoryItem>
						<ItemInvolvesResource>
							<id>1A</id>
							<type>SATELLITE</type>
						</ItemInvolvesResource>
					</ReferencesSPInventoryItem>
				</SPInventoryComprisedOf>
			</SPInventory>
		</dns:ManageSPInventoryRequest>
	</soapenv:Body>
</soapenv:Envelope>